{
  "Sulphur": "Sulphur is a major anti-psoric remedy, often indicated for chronic skin conditions with itching and burning, especially burning soles. It suits intellectual, lazy individuals who dislike bathing, and have hot palms and feet.",
  "Natrum Mur": "Natrum Mur is ideal for reserved, introverted individuals who suppress emotions. Symptoms often include sunken eyes, paleness, dryness of lips, and aggravation from grief or past emotional trauma.",
  "Phosphorus": "Phosphorus suits tall, thin, sensitive, and emotional people. They are sympathetic, crave cold drinks, and suffer from nervous exhaustion. It also helps with facial emaciation and bleeding tendencies.",
  "Sepia": "Sepia is known for hormonal imbalances, especially in women with sadness before menses, bearing-down sensation, and aversion to family. Constitutionally suited to weak, chilly, indifferent individuals.",
  "Pulsatilla": "Pulsatilla is mild, yielding, and tearful. Best suited for those with changeable symptoms, desires open air, and dislikes heat. Often prescribed in menses irregularities and weeping mood swings.",
  "Calcarea Carb": "Calcarea Carb is suited to fair, fat, flabby individuals who are chilly, sweat easily, and tire quickly. Often has sour cravings, constipation, and fear of insanity or misfortune.",
  "Psorinum": "Psorinum is used in patients with filthy-looking skin, extreme sensitivity to cold, and chronic relapsing skin disorders like eczema or psoriasis. The patient is often pessimistic and anxious about recovery.",
  "China": "China is indicated in debility after blood loss or long illness. Complaints include anemia, weakness, flatulence, and oversensitivity to light and noise.",
  "Syzygium Jambolanum": "Syzygium is specific for diabetes mellitus. It reduces sugar levels and alleviates excessive thirst, urination, and appetite associated with diabetes.",
  "Lycopodium": "Lycopodium suits individuals with low self-confidence, digestive issues like bloating and gas, and a craving for sweets. Useful in liver disorders and hypothyroidism.",
  "Ferrum Phos": "Ferrum Phos is the remedy for early stages of inflammation, anemia, and low-grade fever. It’s suited for pale, weak individuals with easy flushing and bleeding tendencies.",
  "Thyroidinum": "Thyroidinum is used in hypothyroidism, goiter, and metabolic sluggishness. It helps with tiredness, dry skin, obesity, and poor concentration.",
  "Uranium Nitricum": "Uranium Nitricum is used in advanced diabetes cases with weight loss, dry mouth, glycosuria, and general emaciation. It supports kidney function and balances sugar metabolism.",
  "Iodum": "Iodum is indicated in hyperthyroidism with anxiety, heat intolerance, excessive appetite, and weight loss. Suits restless and emaciated individuals.",
  "Belladonna": "Belladonna is used in sudden acute inflammations with redness, heat, and throbbing pain. Patient is oversensitive to light, noise, and touch. Often used in fever, headache, and infections.",
  "Arsenicum Alb": "Arsenicum suits anxious, restless individuals who fear death. Complaints often involve burning pains relieved by warmth, and great prostration with thirst for small sips.",
  "Graphites": "Graphites is indicated in obese individuals with dry, rough, or cracked skin, especially behind ears or on eyelids. Helpful in eczema, constipation, and induration of glands.",
  "Ignatia": "Ignatia is best for acute grief, disappointment, or emotional shock. Contradictory symptoms like silent weeping, changeable moods, and lump in the throat are key indications.",
  "Bryonia": "Bryonia is for dry, aching conditions worse from motion. Patient is irritable, thirsty for large quantities of water, and prefers to lie still.",
  "Tuberculinum": "Tuberculinum is used in weak, chilly, oversensitive persons with recurrent infections, restlessness, and a longing for travel or change. Indicated in chronic allergic or autoimmune cases."
}
